Revit 2018 API
ExporterIFCUtils.GetFamilyName Method
 Gets the family name of an ElementType.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This function is deprecated in Revit 2018.  Please use ElementType.FamilyName instead.")]
public static string GetFamilyName(
	ElementType elemType
)
Visual Basic
<ObsoleteAttribute("This function is deprecated in Revit 2018.  Please use ElementType.FamilyName instead.")> _
Public Shared Function GetFamilyName ( _
	elemType As ElementType _
) As String
Visual C++
[ObsoleteAttribute(L"This function is deprecated in Revit 2018.  Please use ElementType.FamilyName instead.")]
public:
static String^ GetFamilyName(
	ElementType^ elemType
)
Parameters
elemType
Type: Autodesk.Revit.DB.ElementType
 The element type element.
Return Value
 The name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace